In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('weather_by_cities.csv')

In [3]:
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [6]:
df[df.city=='new york'].temperature.max()

36

In [8]:
g= df.groupby('city')
g

In [10]:
for city, data in g:
    print('city:',city)
    print('data:',data)
    print('\n')

city: mumbai
data:         day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain


city: new york
data:         day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny


city: paris
data:          day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [11]:
df.groupby('city').temperature.max()

city
mumbai      92
new york    36
paris       54
Name: temperature, dtype: int64

In [12]:
g.get_group('paris')

         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [13]:
g.max()

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [15]:
g.min()

               day  temperature  windspeed   event
city
mumbai    1/1/2017           85          5     Fog
new york  1/1/2017           28          6    Rain
paris     1/1/2017           42          8  Cloudy

In [16]:
g.describe()

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

In [17]:
g.size()

city
mumbai      4
new york    4
paris       4
dtype: int64

In [21]:
def grouper(df, idx, col):
    if 80<= df[col].loc[idx] <=90: 
        return '80-90'
    elif 50<= df[col].loc[idx] <=60:
        return '50-60'
    else:
        return 'Others'

In [30]:
g = df.groupby(lambda idx: grouper(df, idx,'temperature'))
g

In [28]:
for key, d in g:
    print('Key:', key)
    print('Data:', d)

Key: 50-60
Data:          day   city  temperature  windspeed   event
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
Key: 80-90
Data:         day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
Key: Others
Data:          day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
11  1/4/2017     paris           42         10  Cloudy

CONCAT AND MERGE

In [2]:
india_weather=pd.DataFrame({
    'city': ['mumbai', 'delhi', 'banglore'],
    'temperature': [32,45,30],
    'humidity': [80,60,78]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [3]:
us_weather=pd.DataFrame({
    'city': ['newyork', 'chicago', 'orlando'],
    'temperature': [22,14,35],
    'humidity': [82,65,75]
})
us_weather

      city  temperature  humidity
0  newyork           22        82
1  chicago           14        65
2  orlando           35        75

In [6]:
df=pd.concat([india_weather, us_weather], keys=['india','us'])
df

             city  temperature  humidity
india 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
us    0   newyork           22        82
      1   chicago           14        65
      2   orlando           35        75

In [7]:
df.loc['india']

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [12]:
temperature_df = pd.DataFrame({
    'city': ['mumbai', 'delhi', 'banglore'],
    'temperature': [32,14,35]
}, index=[0,1,2])
temperature_df

       city  temperature
0    mumbai           32
1     delhi           14
2  banglore           35

In [13]:
windspeed_df=pd.DataFrame({
    'city': ['mumbai', 'delhi'],
    'windspeed': [7,12]}, index = [0,1)
windspeed_df

     city  windspeed
0  mumbai          7
1   delhi         12

In [15]:
pd.concat([temperature_df,windspeed_df], axis = 1)

       city  temperature    city  windspeed
0    mumbai           32  mumbai        7.0
1     delhi           14   delhi       12.0
2  banglore           35     NaN        NaN

In [21]:
df_merged=pd.merge(temperature_df, windspeed_df, on="city", how='outer')
df_merged

       city  temperature  windspeed
0    mumbai           32        7.0
1     delhi           14       12.0
2  banglore           35        NaN